user/tutorials/pISAT/3D_shockDroplet/constant/ISATDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      ISATDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

TEvfctree_XrhoP
{
    noISAT true;
    checkInterval  20;
    maxDepthFactor   2;
    muted true;
        preAllocateLeaf 20;
    preAllocateNode 100;
    //maxNLeafs 10000; //tuning using activated leafs
    maxNLeafs
    {
        type adaptive;//const; //adaptive 
        value 10000;
        base 100;
        ratio 1.3;
        range 4;
        max 100000;
    }
    NtimeTag 5;
    maxLeafsize (0.3 50 1e6);
    toleranceOut (1e-1 100 1e-2 5);//(1e-0 1e-1 1e-3 1e-1);//BUG input!!(1e-10 1e-10 1e-10);//(1e-0 1e-0 1e-3);//(1e-1 1e-8 1e-3);
    initToleranceIn (1e-5 1e-2 10);
    scaleIn (1 200 1e7);//(1 1 1 1);//(1 1 2.3e+07 500);
}


Trhovfctree_XEP
{
    noISAT true;
    checkInterval  20;
    maxDepthFactor   2;
    preAllocateLeaf 20;
    preAllocateNode 100;
    //maxNLeafs 10000; //tuning using activated leafs
    maxNLeafs
    {
        type adaptive;//const; //adaptive 
        value 10000;
        base 100;
        ratio 1.3;
        range 4;
        max 100000;
    }
    NtimeTag 5;
    maxLeafsize (0.3 50 1e6);
    toleranceOut (1e-1 100 1e-2 5);//(1e-0 1e-1 1e-3 1e-1);//BUG input!!(1e-10 1e-10 1e-10);//(1e-0 1e-0 1e-3);//(1e-1 1e-8 1e-3);
    initToleranceIn (1e-5 1e-2 10);
    scaleIn (1 200 1e7);//(1 1 1 1);//(1 1 2.3e+07 500);
}

THvfctree_XrhoP
{
    noISAT true;
    checkInterval  20;
    maxDepthFactor   2;
    muted true; 
    preAllocateLeaf 20;
    preAllocateNode 100;
    //maxNLeafs 10000; //tuning using activated leafs
    maxNLeafs
    {
        type adaptive;//const; //adaptive 
        value 10000;
        base 100;
        ratio 1.3;
        range 4;
        max 100000;
    }
    NtimeTag 5;
    maxLeafsize (0.3 50 1e6);
    toleranceOut (1e-1 100 1e-2 5);//(1e-0 1e-1 1e-3 1e-1);//BUG input!!(1e-10 1e-10 1e-10);//(1e-0 1e-0 1e-3);//(1e-1 1e-8 1e-3);
    initToleranceIn (1e-5 1e-2 10);
    scaleIn (1 200 1e7);//(1 1 1 1);//(1 1 2.3e+07 500);
}
Erhovfctree_XTP
{
    noISAT true;//true;
    checkInterval  20;
    maxDepthFactor   2;
    muted true;
    preAllocateLeaf 20;
    preAllocateNode 100;
    //maxNLeafs 1000; //tuning using activated leafs

    maxNLeafs
    {
        type const; //adaptive 
        value 1000;
    }
    NtimeTag 5;
    maxLeafsize (0.3 50 1e6);
    toleranceOut (1e2 1e-1 1e-2 5);//BUG input!!(1e-10 1e-10 1e-10);//(1e-0 1e-0 1e-3);//(1e-1 1e-8 1e-3);
    initToleranceIn (1e-4 1e-3 10);
    scaleIn (1 100 1e7);//(1 1 1 1);//(1 1 2.3e+07 500);
}

TPvfctree_XErho
{
    noISAT false;//true;//false;//true;//false;//true;
    checkInterval  20;
    maxDepthFactor   3;
    muted false;
    preAllocateLeaf 800;
    preAllocateNode 4000;
    //maxNLeafs 1000; //tuning using activated leafs

    maxNLeafs
    {
        type maxTimeTag;//const; //adaptive
        value 5000;
        base 50000;
        ratio 5.5;
        range 8;//5;
        max 300000;
        maxTimeTag 80;
    }
    NtimeTag 100;
    maxLeafsize (0.4 5e4 3e2);
    toleranceOut (3e0 3e5 3e-2 3e0);//BUG input!!(1e-10 1e-10 1e-10);//(1e-0 1e-0 1e-3);//(1e-1 1e-8 1e-3);
    initToleranceIn (1e-4 1e-2 1e-4);
    scaleIn (1 4e4 2e2);//(1 1 1 1);//(1 1 2.3e+07 500);
}


